Problem: Given a DataFrame, identify the count of missing values in each column.

In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'A':[1,2,3,4,np.nan,np.nan,5],
                  'B':[5,6,7,np.nan,np.nan,6,8],
                  'C':[1,2,3,4,5,6,9]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2
2  3.0  7.0  3
3  4.0  NaN  4
4  NaN  NaN  5
5  NaN  6.0  6
6  5.0  8.0  9

In [7]:
df.isna().sum()

A    2
B    2
C    0
dtype: int64

Problem: Given a DataFrame, drop the rows that contain missing values.

In [9]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3
3  4
4  5
5  6
6  9

Problem: Given a DataFrame, fill the missing values in a specific column with a specified value. A column with = 5 B column with = 10 c column with = 15

In [13]:
fill_values = {'A': 5, 'B': 10, 'C': 15}
df.fillna(value = fill_values)

     A     B  C
0  1.0   5.0  1
1  2.0   6.0  2
2  3.0   7.0  3
3  4.0  10.0  4
4  5.0  10.0  5
5  5.0   6.0  6
6  5.0   8.0  9

Problem: Given a DataFrame, fill the missing values with the mean of the respective column.

In [14]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  6.0  2
2  3.0  7.0  3
3  4.0  6.4  4
4  3.0  6.4  5
5  3.0  6.0  6
6  5.0  8.0  9

Problem: Given a DataFrame, interpolate the missing values using linear interpolation.

In [15]:
df.interpolate(method='linear')

          A         B  C
0  1.000000  5.000000  1
1  2.000000  6.000000  2
2  3.000000  7.000000  3
3  4.000000  6.666667  4
4  4.333333  6.333333  5
5  4.666667  6.000000  6
6  5.000000  8.000000  9